app/controllers/api/options_controller.rb

    def create
        # debugger
        @option = Option.new(option_params)
        # debugger
        @option[:count] = 0

        if @option.save
---
INSERT INTO "options" ("title", "poll_id", "count", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "opt12"], ["poll_id", 25], ["count", 0], ["created_at", "2020-04-13 20:33:49.758364"], ["updated_at", "2020-04-13 20:33:49.758364"]]

    def update
        # debugger
        @option = Option.find(params[:id])
        new_count = @option[:count] + 1
        new_params = {
            title: @option.title,
            poll_id: @option.poll_id,
            count: new_count
        }

        if @option.update(new_params)
---
SELECT  "options".* FROM "options" WHERE "options"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "options" SET "count" = $1, "updated_at" = $2 WHERE "options"."id" = $3  [["count", 37], ["updated_at", "2020-04-15 14:25:35.632015"], ["id", 5]]

    def index
        if params[:poll_id]
            @options = Option.where(poll_id: params[:poll_id])
        else
            @options = Option.all
---
SELECT "options".* FROM "options" WHERE "options"."poll_id" = $1  [["poll_id", 36]]