app/controllers/api/polls_controller.rb

    def create
        #debugger
        @poll = Poll.new(poll_params)

        if @poll.save
---
INSERT INTO "polls" ("title", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "firstFormPoll"], ["author_id", 22], ["created_at", "2020-04-13 19:16:58.331587"], ["updated_at", "2020-04-13 19:16:58.331587"]]

    def show
        #debugger
        @poll = Poll.find(params[:id])
---
SELECT  "polls".* FROM "polls" WHERE "polls"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

    def index
        if params[:author_id]
            @polls = Poll.where(author_id: params[:author_id])
        else
            @polls = Poll.all
---
SELECT "polls".* FROM "polls" WHERE "polls"."author_id" = $1  [["author_id", 22]]

    def destroy
        #debugger
        @poll = Poll.find(params[:id])
        author_id = @poll.author_id

        if @poll.destroy
            @polls = Poll.where(author_id: author_id)
---
SELECT  "polls".* FROM "polls" WHERE "polls"."id" = $1 LIMIT $2  [["id", 39], ["LIMIT", 1]]
DELETE FROM "polls" WHERE "polls"."id" = $1  [["id", 39]]
SELECT "polls".* FROM "polls" WHERE "polls"."author_id" = $1  [["author_id", 22]]