app/views/api/polls/show.json.jbuilder


@poll.options.each do |option|
---
SELECT "options".* FROM "options" WHERE "options"."poll_id" = $1  [["poll_id", 3]]