app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "/Kud82+2fCakl+Gr7VfRoVg18EaWtITdwrN8r07TH0HdMP7BwFL02kHhLkza1I4ZbeCXzhGuS0COAd7TXKZhXA=="], ["updated_at", "2020-04-13 11:37:54.901458"], ["id", 22]]
---
    def reset_session_token!
        self.session_token = SecureRandom.base64(64)
        self.save!